/*
Исключения в программировании и их обработка (семинары)
Урок 1. Обработка ошибок в программировании
https://gb.ru/lessons/420867

Что будет на уроке сегодня

* посмотреть откуда могут браться ошибки
* научиться обрабатывать исключительные ситуации с помощью кодов ошибок и исключений
* научиться бросать исключения, когда метод не может выполнить корректно свою работу


Exeptions - исключения
Error - программные ошибки


00:11:30

Деление (divide) на ноль

 */
package Exceptions.Seminar.Sem01.info;

public class Info {
    
}
